[Killed] EqualityOperator
server/utils/priceCalculator.js:59:7
 
   // --- Input Validation ---
   // Ensure fundamental pricing components are valid.
-  if (baseFare <= 0 || numberOfPassengers <= 0) {
+  if (baseFare > 0 || numberOfPassengers <= 0) {
     console.error(`Invalid input: baseFare=${baseFare}, numberOfPassengers=${numberOfPassengers}. Both must be positive.`);
     throw new Error('Base fare and number of passengers must be positive.');
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] EqualityOperator
server/utils/priceCalculator.js:59:7
 
   // --- Input Validation ---
   // Ensure fundamental pricing components are valid.
-  if (baseFare <= 0 || numberOfPassengers <= 0) {
+  if (baseFare < 0 || numberOfPassengers <= 0) {
     console.error(`Invalid input: baseFare=${baseFare}, numberOfPassengers=${numberOfPassengers}. Both must be positive.`);
     throw new Error('Base fare and number of passengers must be positive.');
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] BlockStatement
server/utils/priceCalculator.js:64:22
     throw new Error('Base fare and number of passengers must be positive.');
   }
   // Ensure extra baggage count is valid.
-  if (extraBags < 0) {
-    console.error(`Invalid input: extraBags=${extraBags}. Cannot be negative.`);
-    throw new Error('Extra bags cannot be negative.');
-  }
+  if (extraBags < 0) {}
 
   // Validate passengerAge if provided
killedBy: Price Calculator Unit Tests Input Validation Errors should throw error if extraBags is negative
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
server/utils/priceCalculator.js:64:7
     throw new Error('Base fare and number of passengers must be positive.');
   }
   // Ensure extra baggage count is valid.
-  if (extraBags < 0) {
+  if (extraBags <= 0) {
     console.error(`Invalid input: extraBags=${extraBags}. Cannot be negative.`);
     throw new Error('Extra bags cannot be negative.');
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Survived] StringLiteral
server/utils/priceCalculator.js:65:19
   }
   // Ensure extra baggage count is valid.
   if (extraBags < 0) {
-    console.error(`Invalid input: extraBags=${extraBags}. Cannot be negative.`);
+    console.error(``);
     throw new Error('Extra bags cannot be negative.');
   }

[Killed] StringLiteral
server/utils/priceCalculator.js:66:21
   // Ensure extra baggage count is valid.
   if (extraBags < 0) {
     console.error(`Invalid input: extraBags=${extraBags}. Cannot be negative.`);
-    throw new Error('Extra bags cannot be negative.');
+    throw new Error("");
   }
 
killedBy: Price Calculator Unit Tests Input Validation Errors should throw error if extraBags is negative
statusReason: expected [Function] to throw error including 'Extra bags cannot be negative.' but got ''

[Killed] LogicalOperator
server/utils/priceCalculator.js:70:38
   }
 
   // Validate passengerAge if provided
-  if (passengerAge !== undefined && (typeof passengerAge !== 'number' || passengerAge < 0 || !Number.isInteger(passengerAge))) {
+  if (passengerAge !== undefined && ((typeof passengerAge !== 'number' || passengerAge < 0) && !Number.isInteger(passengerAge))) {
     console.error(`Invalid input: passengerAge=${passengerAge}. Must be a non-negative integer if provided.`);
     throw new Error('Passenger age must be a non-negative integer if provided.');
killedBy: Price Calculator Unit Tests Input Validation Errors should throw error if passengerAge is negative
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
server/utils/priceCalculator.js:70:7
   }
 
   // Validate passengerAge if provided
-  if (passengerAge !== undefined && (typeof passengerAge !== 'number' || passengerAge < 0 || !Number.isInteger(passengerAge))) {
+  if (false) {
     console.error(`Invalid input: passengerAge=${passengerAge}. Must be a non-negative integer if provided.`);
     throw new Error('Passenger age must be a non-negative integer if provided.');
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Survived] StringLiteral
server/utils/priceCalculator.js:71:19
 
   // Validate passengerAge if provided
   if (passengerAge !== undefined && (typeof passengerAge !== 'number' || passengerAge < 0 || !Number.isInteger(passengerAge))) {
-    console.error(`Invalid input: passengerAge=${passengerAge}. Must be a non-negative integer if provided.`);
+    console.error(``);
     throw new Error('Passenger age must be a non-negative integer if provided.');
   }

[Killed] StringLiteral
server/utils/priceCalculator.js:72:21
   // Validate passengerAge if provided
   if (passengerAge !== undefined && (typeof passengerAge !== 'number' || passengerAge < 0 || !Number.isInteger(passengerAge))) {
     console.error(`Invalid input: passengerAge=${passengerAge}. Must be a non-negative integer if provided.`);
-    throw new Error('Passenger age must be a non-negative integer if provided.');
+    throw new Error("");
   }
 
killedBy: Price Calculator Unit Tests Input Validation Errors should throw error if passengerAge is negative
statusReason: expected [Function] to throw error including 'Passenger age must be a non-negative …' but got ''

[Killed] EqualityOperator
server/utils/priceCalculator.js:76:37
   }
 
   // Validate hasInsurance if provided
-  if (hasInsurance !== undefined && typeof hasInsurance !== 'boolean') {
+  if (hasInsurance !== undefined && typeof hasInsurance === 'boolean') {
     console.error(`Invalid input: hasInsurance=${hasInsurance}. Must be a boolean if provided.`);
     throw new Error('hasInsurance must be a boolean if provided.');
killedBy: Price Calculator Unit Tests Input Validation Errors should throw error if hasInsurance is not a boolean
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
server/utils/priceCalculator.js:76:7
   }
 
   // Validate hasInsurance if provided
-  if (hasInsurance !== undefined && typeof hasInsurance !== 'boolean') {
+  if (false) {
     console.error(`Invalid input: hasInsurance=${hasInsurance}. Must be a boolean if provided.`);
     throw new Error('hasInsurance must be a boolean if provided.');
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] ArrayDeclaration
server/utils/priceCalculator.js:82:30
   }
 
   // Validate travelClass
-  const validTravelClasses = ['economy', 'business', 'first'];
+  const validTravelClasses = [];
   if (!validTravelClasses.includes(travelClass)) {
     console.error(`Invalid input: travelClass=${travelClass}. Must be one of ${validTravelClasses.join(', ')}.`);
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] BlockStatement
server/utils/priceCalculator.js:83:50
 
   // Validate travelClass
   const validTravelClasses = ['economy', 'business', 'first'];
-  if (!validTravelClasses.includes(travelClass)) {
-    console.error(`Invalid input: travelClass=${travelClass}. Must be one of ${validTravelClasses.join(', ')}.`);
-    throw new Error(`Travel class must be one of ${validTravelClasses.join(', ')}.`);
-  }
+  if (!validTravelClasses.includes(travelClass)) {}
 
   // --- Core Price Calculation ---
killedBy: Price Calculator Unit Tests Input Validation Errors should throw error if travelClass is invalid
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
server/utils/priceCalculator.js:83:7
 
   // Validate travelClass
   const validTravelClasses = ['economy', 'business', 'first'];
-  if (!validTravelClasses.includes(travelClass)) {
+  if (validTravelClasses.includes(travelClass)) {
     console.error(`Invalid input: travelClass=${travelClass}. Must be one of ${validTravelClasses.join(', ')}.`);
     throw new Error(`Travel class must be one of ${validTravelClasses.join(', ')}.`);
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Survived] StringLiteral
server/utils/priceCalculator.js:84:104
   // Validate travelClass
   const validTravelClasses = ['economy', 'business', 'first'];
   if (!validTravelClasses.includes(travelClass)) {
-    console.error(`Invalid input: travelClass=${travelClass}. Must be one of ${validTravelClasses.join(', ')}.`);
+    console.error(`Invalid input: travelClass=${travelClass}. Must be one of ${validTravelClasses.join("")}.`);
     throw new Error(`Travel class must be one of ${validTravelClasses.join(', ')}.`);
   }

[Killed] ArithmeticOperator
server/utils/priceCalculator.js:90:20
 
   // --- Core Price Calculation ---
   // Start with the base cost multiplied by the number of passengers.
-  let totalPrice = baseFare * numberOfPassengers;
+  let totalPrice = baseFare / numberOfPassengers;
 
   // Apply travel class multipliers
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] AssignmentOperator
server/utils/priceCalculator.js:98:3
     business: 1.8,
     first: 2.5,
   };
-  totalPrice *= CLASS_MULTIPLIERS[travelClass];
+  totalPrice /= CLASS_MULTIPLIERS[travelClass];
 
   // Add insurance cost if selected
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] ConditionalExpression
server/utils/priceCalculator.js:102:7
 
   // Add insurance cost if selected
   const INSURANCE_COST_PER_PASSENGER = 30;
-  if (hasInsurance) {
+  if (false) {
     totalPrice += INSURANCE_COST_PER_PASSENGER * numberOfPassengers;
   }
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] BlockStatement
server/utils/priceCalculator.js:102:21
 
   // Add insurance cost if selected
   const INSURANCE_COST_PER_PASSENGER = 30;
-  if (hasInsurance) {
-    totalPrice += INSURANCE_COST_PER_PASSENGER * numberOfPassengers;
-  }
+  if (hasInsurance) {}
 
   let taxRate = 0; // Initialize tax rate
killedBy: Price Calculator Unit Tests Insurance Costs should add insurance cost if hasInsurance is true
statusReason: expected 112 to equal 145.6

[Killed] ArithmeticOperator
server/utils/priceCalculator.js:103:19
   // Add insurance cost if selected
   const INSURANCE_COST_PER_PASSENGER = 30;
   if (hasInsurance) {
-    totalPrice += INSURANCE_COST_PER_PASSENGER * numberOfPassengers;
+    totalPrice += INSURANCE_COST_PER_PASSENGER / numberOfPassengers;
   }
 
killedBy: Price Calculator Unit Tests Insurance Costs should add insurance cost for multiple passengers if hasInsurance is true
statusReason: expected 240.8 to equal 291.2

[Killed] AssignmentOperator
server/utils/priceCalculator.js:103:5
   // Add insurance cost if selected
   const INSURANCE_COST_PER_PASSENGER = 30;
   if (hasInsurance) {
-    totalPrice += INSURANCE_COST_PER_PASSENGER * numberOfPassengers;
+    totalPrice -= INSURANCE_COST_PER_PASSENGER * numberOfPassengers;
   }
 
killedBy: Price Calculator Unit Tests Insurance Costs should add insurance cost if hasInsurance is true
statusReason: expected 78.4 to equal 145.6

[Killed] EqualityOperator
server/utils/priceCalculator.js:115:7
 
   // Determine the applicable tax rate based on flight type.
   // Explicit boolean checks are used here for robust mutation testing.
-  if (isInternational === true) {
+  if (isInternational !== true) {
     taxRate = INTERNATIONAL_TAX_RATE;
   } else if (isInternational === false) {
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] BooleanLiteral
server/utils/priceCalculator.js:115:27
 
   // Determine the applicable tax rate based on flight type.
   // Explicit boolean checks are used here for robust mutation testing.
-  if (isInternational === true) {
+  if (isInternational === false) {
     taxRate = INTERNATIONAL_TAX_RATE;
   } else if (isInternational === false) {
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] ConditionalExpression
server/utils/priceCalculator.js:117:14
   // Explicit boolean checks are used here for robust mutation testing.
   if (isInternational === true) {
     taxRate = INTERNATIONAL_TAX_RATE;
-  } else if (isInternational === false) {
+  } else if (true) {
     taxRate = DOMESTIC_TAX_RATE;
   } else {
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] EqualityOperator
server/utils/priceCalculator.js:117:14
   // Explicit boolean checks are used here for robust mutation testing.
   if (isInternational === true) {
     taxRate = INTERNATIONAL_TAX_RATE;
-  } else if (isInternational === false) {
+  } else if (isInternational !== false) {
     taxRate = DOMESTIC_TAX_RATE;
   } else {
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] BlockStatement
server/utils/priceCalculator.js:119:10
     taxRate = INTERNATIONAL_TAX_RATE;
   } else if (isInternational === false) {
     taxRate = DOMESTIC_TAX_RATE;
-  } else {
-    // If 'isInternational' is not explicitly boolean (e.g., undefined, null, or other type),
-    // default to domestic tax rate for safety and consistency.
-    console.warn(`'isInternational' flag is not a boolean (${isInternational}). Defaulting to domestic tax rate.`);
-    taxRate = DOMESTIC_TAX_RATE;
-  }
+  } else {}
   // Apply the calculated tax to the current total price.
   totalPrice += totalPrice * taxRate;
killedBy: Price Calculator Unit Tests Basic Price Calculation without Extras or Discounts should apply domestic tax if isInternational is not a boolean (e.g., string)
statusReason: expected 100 to equal 112

[Killed] ArithmeticOperator
server/utils/priceCalculator.js:126:17
     taxRate = DOMESTIC_TAX_RATE;
   }
   // Apply the calculated tax to the current total price.
-  totalPrice += totalPrice * taxRate;
+  totalPrice += totalPrice / taxRate;
 
   // --- Age-based Discount Logic ---
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] AssignmentOperator
server/utils/priceCalculator.js:126:3
     taxRate = DOMESTIC_TAX_RATE;
   }
   // Apply the calculated tax to the current total price.
-  totalPrice += totalPrice * taxRate;
+  totalPrice -= totalPrice * taxRate;
 
   // --- Age-based Discount Logic ---
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] ConditionalExpression
server/utils/priceCalculator.js:130:7
 
   // --- Age-based Discount Logic ---
   // Apply a discount if passengerAge is provided and meets certain criteria
-  if (passengerAge !== undefined) {
+  if (false) {
     const SENIOR_DISCOUNT_PERCENTAGE = 0.15; // 15% discount for seniors (60+)
     const CHILD_DISCOUNT_PERCENTAGE = 0.20;  // 20% discount for children (under 12)
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] BlockStatement
server/utils/priceCalculator.js:130:35
 
   // --- Age-based Discount Logic ---
   // Apply a discount if passengerAge is provided and meets certain criteria
-  if (passengerAge !== undefined) {
-    const SENIOR_DISCOUNT_PERCENTAGE = 0.15; // 15% discount for seniors (60+)
-    const CHILD_DISCOUNT_PERCENTAGE = 0.20;  // 20% discount for children (under 12)
-
-    if (passengerAge >= 60) {
-      const discountAmount = totalPrice * SENIOR_DISCOUNT_PERCENTAGE;
-      totalPrice -= discountAmount;
-      console.log(`Senior discount applied: -$${discountAmount.toFixed(2)}`);
-    } else if (passengerAge < 12) {
-      const discountAmount = totalPrice * CHILD_DISCOUNT_PERCENTAGE;
-      totalPrice -= discountAmount;
-      console.log(`Child discount applied: -$${discountAmount.toFixed(2)}`);
-    }
-  }
+  if (passengerAge !== undefined) {}
 
   // --- Baggage Fees Calculation ---
killedBy: Price Calculator Unit Tests Age-based Discounts should apply 15% senior discount for passenger age 60 or more
statusReason: expected 224 to equal 190.4

[Killed] ConditionalExpression
server/utils/priceCalculator.js:134:9
     const SENIOR_DISCOUNT_PERCENTAGE = 0.15; // 15% discount for seniors (60+)
     const CHILD_DISCOUNT_PERCENTAGE = 0.20;  // 20% discount for children (under 12)
 
-    if (passengerAge >= 60) {
+    if (false) {
       const discountAmount = totalPrice * SENIOR_DISCOUNT_PERCENTAGE;
       totalPrice -= discountAmount;
killedBy: Price Calculator Unit Tests Age-based Discounts should apply 15% senior discount for passenger age 60 or more
statusReason: expected 224 to equal 190.4

[Killed] EqualityOperator
server/utils/priceCalculator.js:134:9
     const SENIOR_DISCOUNT_PERCENTAGE = 0.15; // 15% discount for seniors (60+)
     const CHILD_DISCOUNT_PERCENTAGE = 0.20;  // 20% discount for children (under 12)
 
-    if (passengerAge >= 60) {
+    if (passengerAge < 60) {
       const discountAmount = totalPrice * SENIOR_DISCOUNT_PERCENTAGE;
       totalPrice -= discountAmount;
killedBy: Price Calculator Unit Tests Age-based Discounts should apply 15% senior discount for passenger age 60 or more
statusReason: expected 224 to equal 190.4

[Killed] ArithmeticOperator
server/utils/priceCalculator.js:135:30
     const CHILD_DISCOUNT_PERCENTAGE = 0.20;  // 20% discount for children (under 12)
 
     if (passengerAge >= 60) {
-      const discountAmount = totalPrice * SENIOR_DISCOUNT_PERCENTAGE;
+      const discountAmount = totalPrice / SENIOR_DISCOUNT_PERCENTAGE;
       totalPrice -= discountAmount;
       console.log(`Senior discount applied: -$${discountAmount.toFixed(2)}`);
killedBy: Price Calculator Unit Tests Age-based Discounts should apply 15% senior discount for passenger age 60 or more
statusReason: expected +0 to equal 190.4

[Killed] AssignmentOperator
server/utils/priceCalculator.js:136:7
 
     if (passengerAge >= 60) {
       const discountAmount = totalPrice * SENIOR_DISCOUNT_PERCENTAGE;
-      totalPrice -= discountAmount;
+      totalPrice += discountAmount;
       console.log(`Senior discount applied: -$${discountAmount.toFixed(2)}`);
     } else if (passengerAge < 12) {
killedBy: Price Calculator Unit Tests Age-based Discounts should apply 15% senior discount for passenger age 60 or more
statusReason: expected 257.6 to equal 190.4

[Killed] ConditionalExpression
server/utils/priceCalculator.js:138:16
       const discountAmount = totalPrice * SENIOR_DISCOUNT_PERCENTAGE;
       totalPrice -= discountAmount;
       console.log(`Senior discount applied: -$${discountAmount.toFixed(2)}`);
-    } else if (passengerAge < 12) {
+    } else if (false) {
       const discountAmount = totalPrice * CHILD_DISCOUNT_PERCENTAGE;
       totalPrice -= discountAmount;
killedBy: Price Calculator Unit Tests Age-based Discounts should apply 20% child discount for passenger age less than 12
statusReason: expected 224 to equal 179.2

[Killed] BlockStatement
server/utils/priceCalculator.js:138:35
       const discountAmount = totalPrice * SENIOR_DISCOUNT_PERCENTAGE;
       totalPrice -= discountAmount;
       console.log(`Senior discount applied: -$${discountAmount.toFixed(2)}`);
-    } else if (passengerAge < 12) {
-      const discountAmount = totalPrice * CHILD_DISCOUNT_PERCENTAGE;
-      totalPrice -= discountAmount;
-      console.log(`Child discount applied: -$${discountAmount.toFixed(2)}`);
-    }
+    } else if (passengerAge < 12) {}
   }
 
killedBy: Price Calculator Unit Tests Age-based Discounts should apply 20% child discount for passenger age less than 12
statusReason: expected 224 to equal 179.2

[Killed] ArithmeticOperator
server/utils/priceCalculator.js:139:30
       totalPrice -= discountAmount;
       console.log(`Senior discount applied: -$${discountAmount.toFixed(2)}`);
     } else if (passengerAge < 12) {
-      const discountAmount = totalPrice * CHILD_DISCOUNT_PERCENTAGE;
+      const discountAmount = totalPrice / CHILD_DISCOUNT_PERCENTAGE;
       totalPrice -= discountAmount;
       console.log(`Child discount applied: -$${discountAmount.toFixed(2)}`);
killedBy: Price Calculator Unit Tests Age-based Discounts should apply 20% child discount for passenger age less than 12
statusReason: expected +0 to equal 179.2

[Killed] AssignmentOperator
server/utils/priceCalculator.js:140:7
       console.log(`Senior discount applied: -$${discountAmount.toFixed(2)}`);
     } else if (passengerAge < 12) {
       const discountAmount = totalPrice * CHILD_DISCOUNT_PERCENTAGE;
-      totalPrice -= discountAmount;
+      totalPrice += discountAmount;
       console.log(`Child discount applied: -$${discountAmount.toFixed(2)}`);
     }
killedBy: Price Calculator Unit Tests Age-based Discounts should apply 20% child discount for passenger age less than 12
statusReason: expected 268.8 to equal 179.2

[Survived] StringLiteral
server/utils/priceCalculator.js:141:19
     } else if (passengerAge < 12) {
       const discountAmount = totalPrice * CHILD_DISCOUNT_PERCENTAGE;
       totalPrice -= discountAmount;
-      console.log(`Child discount applied: -$${discountAmount.toFixed(2)}`);
+      console.log(``);
     }
   }

[Killed] EqualityOperator
server/utils/priceCalculator.js:150:7
   const BAGGAGE_FEES_TIER2 = 75;  // 2nd extra bag
   const BAGGAGE_FEES_TIER3 = 100; // 3rd+ extra bag
 
-  if (extraBags > 0) {
+  if (extraBags <= 0) {
     let baggageCost = 0;
     if (extraBags === 1) {
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] ConditionalExpression
server/utils/priceCalculator.js:150:7
   const BAGGAGE_FEES_TIER2 = 75;  // 2nd extra bag
   const BAGGAGE_FEES_TIER3 = 100; // 3rd+ extra bag
 
-  if (extraBags > 0) {
+  if (true) {
     let baggageCost = 0;
     if (extraBags === 1) {
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] ConditionalExpression
server/utils/priceCalculator.js:152:9
 
   if (extraBags > 0) {
     let baggageCost = 0;
-    if (extraBags === 1) {
+    if (true) {
       baggageCost = BAGGAGE_FEES_TIER1;
     } else if (extraBags === 2) {
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] EqualityOperator
server/utils/priceCalculator.js:152:9
 
   if (extraBags > 0) {
     let baggageCost = 0;
-    if (extraBags === 1) {
+    if (extraBags !== 1) {
       baggageCost = BAGGAGE_FEES_TIER1;
     } else if (extraBags === 2) {
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] ConditionalExpression
server/utils/priceCalculator.js:154:16
     let baggageCost = 0;
     if (extraBags === 1) {
       baggageCost = BAGGAGE_FEES_TIER1;
-    } else if (extraBags === 2) {
+    } else if (true) {
       baggageCost = BAGGAGE_FEES_TIER1 + BAGGAGE_FEES_TIER2;
     } else { // 3 or more
killedBy: Price Calculator Unit Tests Tiered Baggage Fees should charge Tier 1 + Tier 2 + Tier 3 fees for 3 extra bags
statusReason: expected 237 to equal 337

[Killed] BlockStatement
server/utils/priceCalculator.js:154:33
     let baggageCost = 0;
     if (extraBags === 1) {
       baggageCost = BAGGAGE_FEES_TIER1;
-    } else if (extraBags === 2) {
-      baggageCost = BAGGAGE_FEES_TIER1 + BAGGAGE_FEES_TIER2;
-    } else { // 3 or more
+    } else if (extraBags === 2) {} else { // 3 or more
       baggageCost = BAGGAGE_FEES_TIER1 + BAGGAGE_FEES_TIER2 + (extraBags - 2) * BAGGAGE_FEES_TIER3;
     }
killedBy: Price Calculator Unit Tests Additional Fees (Baggage and Meals) should add correct fees for extra baggage (2 bags) using tiered logic
statusReason: expected 112 to equal 237

[Killed] ArithmeticOperator
server/utils/priceCalculator.js:155:21
     if (extraBags === 1) {
       baggageCost = BAGGAGE_FEES_TIER1;
     } else if (extraBags === 2) {
-      baggageCost = BAGGAGE_FEES_TIER1 + BAGGAGE_FEES_TIER2;
+      baggageCost = BAGGAGE_FEES_TIER1 - BAGGAGE_FEES_TIER2;
     } else { // 3 or more
       baggageCost = BAGGAGE_FEES_TIER1 + BAGGAGE_FEES_TIER2 + (extraBags - 2) * BAGGAGE_FEES_TIER3;
killedBy: Price Calculator Unit Tests Additional Fees (Baggage and Meals) should add correct fees for extra baggage (2 bags) using tiered logic
statusReason: expected 87 to equal 237

[Killed] BlockStatement
server/utils/priceCalculator.js:156:12
       baggageCost = BAGGAGE_FEES_TIER1;
     } else if (extraBags === 2) {
       baggageCost = BAGGAGE_FEES_TIER1 + BAGGAGE_FEES_TIER2;
-    } else { // 3 or more
-      baggageCost = BAGGAGE_FEES_TIER1 + BAGGAGE_FEES_TIER2 + (extraBags - 2) * BAGGAGE_FEES_TIER3;
-    }
+    } else {}
     totalPrice += baggageCost;
   }
killedBy: Price Calculator Unit Tests Tiered Baggage Fees should charge Tier 1 + Tier 2 + Tier 3 fees for 3 extra bags
statusReason: expected 112 to equal 337

[Killed] ArithmeticOperator
server/utils/priceCalculator.js:157:64
     } else if (extraBags === 2) {
       baggageCost = BAGGAGE_FEES_TIER1 + BAGGAGE_FEES_TIER2;
     } else { // 3 or more
-      baggageCost = BAGGAGE_FEES_TIER1 + BAGGAGE_FEES_TIER2 + (extraBags - 2) * BAGGAGE_FEES_TIER3;
+      baggageCost = BAGGAGE_FEES_TIER1 + BAGGAGE_FEES_TIER2 + (extraBags + 2) * BAGGAGE_FEES_TIER3;
     }
     totalPrice += baggageCost;
killedBy: Price Calculator Unit Tests Tiered Baggage Fees should charge Tier 1 + Tier 2 + Tier 3 fees for 3 extra bags
statusReason: expected 737 to equal 337

[Killed] ArithmeticOperator
server/utils/priceCalculator.js:157:21
     } else if (extraBags === 2) {
       baggageCost = BAGGAGE_FEES_TIER1 + BAGGAGE_FEES_TIER2;
     } else { // 3 or more
-      baggageCost = BAGGAGE_FEES_TIER1 + BAGGAGE_FEES_TIER2 + (extraBags - 2) * BAGGAGE_FEES_TIER3;
+      baggageCost = BAGGAGE_FEES_TIER1 - BAGGAGE_FEES_TIER2 + (extraBags - 2) * BAGGAGE_FEES_TIER3;
     }
     totalPrice += baggageCost;
killedBy: Price Calculator Unit Tests Tiered Baggage Fees should charge Tier 1 + Tier 2 + Tier 3 fees for 3 extra bags
statusReason: expected 187 to equal 337

[Killed] AssignmentOperator
server/utils/priceCalculator.js:159:5
     } else { // 3 or more
       baggageCost = BAGGAGE_FEES_TIER1 + BAGGAGE_FEES_TIER2 + (extraBags - 2) * BAGGAGE_FEES_TIER3;
     }
-    totalPrice += baggageCost;
+    totalPrice -= baggageCost;
   }
 
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] ConditionalExpression
server/utils/priceCalculator.js:174:32
   // Validate meal selection and apply the corresponding fee.
   // Ensure mealSelection is a valid key, default to 'none' if invalid or not provided,
   // preventing potential errors from accessing non-existent properties.
-  const actualMealSelection = (mealSelection && MEAL_FEES.hasOwnProperty(mealSelection))
+  const actualMealSelection = (false)
     ? mealSelection
     : 'none';
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] ConditionalExpression
server/utils/priceCalculator.js:174:32
   // Validate meal selection and apply the corresponding fee.
   // Ensure mealSelection is a valid key, default to 'none' if invalid or not provided,
   // preventing potential errors from accessing non-existent properties.
-  const actualMealSelection = (mealSelection && MEAL_FEES.hasOwnProperty(mealSelection))
+  const actualMealSelection = (true)
     ? mealSelection
     : 'none';
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002
