[Killed] LogicalOperator
server/index.js:8:14
 // Initialize the Express application
 const app = express();
 // Define the port for the server to listen on. Defaults to 3001 if not specified in environment variables.
-const PORT = process.env.PORT || 3001;
+const PORT = process.env.PORT && 3001;
 
 // --- Middleware Configuration ---
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5); Client-Side Bypass Testing: /api/book Endpoint should successfully book a flight with valid data
statusReason: Listen method has been called more than once without closing.

[Killed] BlockStatement
server/index.js:25:28
  * GET /
  * A basic health check endpoint to confirm the backend server is running.
  */
-app.get('/', (req, res) => {
-  console.log('GET / request received.');
-  res.status(200).send('Flight Booking Backend is running!');
-});
+app.get('/', (req, res) => {});
 
 /**
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] StringLiteral
server/index.js:25:9
  * GET /
  * A basic health check endpoint to confirm the backend server is running.
  */
-app.get('/', (req, res) => {
+app.get("", (req, res) => {
   console.log('GET / request received.');
   res.status(200).send('Flight Booking Backend is running!');
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] StringLiteral
server/index.js:55:10
  *   dateOfBirth?: string (YYYY-MM-DD)
  * }
  */
-app.post('/api/book', (req, res) => {
+app.post("", (req, res) => {
   console.log('POST /api/book request received with body:', req.body);
   const {
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] ArrayDeclaration
server/index.js:72:16
 
   // --- Server-side Validation Logic ---
   // This array will collect all validation error messages.
-  let errors = [];
+  let errors = ["Stryker was here"];
 
   // Validate Origin
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] BlockStatement
server/index.js:75:76
   let errors = [];
 
   // Validate Origin
-  if (!origin || typeof origin !== 'string' || origin.trim().length === 0) {
-    errors.push('Invalid or missing origin. Origin must be a non-empty string.');
-  }
+  if (!origin || typeof origin !== 'string' || origin.trim().length === 0) {}
 
   // Validate Destination
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] EqualityOperator
server/index.js:75:18
   let errors = [];
 
   // Validate Origin
-  if (!origin || typeof origin !== 'string' || origin.trim().length === 0) {
+  if (!origin || typeof origin === 'string' || origin.trim().length === 0) {
     errors.push('Invalid or missing origin. Origin must be a non-empty string.');
   }
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] ConditionalExpression
server/index.js:80:7
   }
 
   // Validate Destination
-  if (!destination || typeof destination !== 'string' || destination.trim().length === 0) {
+  if (false) {
     errors.push('Invalid or missing destination. Destination must be a non-empty string.');
   }
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] ConditionalExpression
server/index.js:80:7
   }
 
   // Validate Destination
-  if (!destination || typeof destination !== 'string' || destination.trim().length === 0) {
+  if (false || destination.trim().length === 0) {
     errors.push('Invalid or missing destination. Destination must be a non-empty string.');
   }
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] ConditionalExpression
server/index.js:85:7
   }
 
   // Validate Departure Date format and presence
-  if (!departureDate || !/^\d{4}-\d{2}-\d{2}$/.test(departureDate)) {
+  if (false) {
     errors.push('Invalid or missing departure date format. Expected YYYY-MM-DD.');
   } else if (new Date(departureDate) < new Date(new Date().setHours(0, 0, 0, 0))) { // Check if departure date is in the past
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] BooleanLiteral
server/index.js:85:25
   }
 
   // Validate Departure Date format and presence
-  if (!departureDate || !/^\d{4}-\d{2}-\d{2}$/.test(departureDate)) {
+  if (!departureDate || /^\d{4}-\d{2}-\d{2}$/.test(departureDate)) {
     errors.push('Invalid or missing departure date format. Expected YYYY-MM-DD.');
   } else if (new Date(departureDate) < new Date(new Date().setHours(0, 0, 0, 0))) { // Check if departure date is in the past
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] ConditionalExpression
server/index.js:87:14
   // Validate Departure Date format and presence
   if (!departureDate || !/^\d{4}-\d{2}-\d{2}$/.test(departureDate)) {
     errors.push('Invalid or missing departure date format. Expected YYYY-MM-DD.');
-  } else if (new Date(departureDate) < new Date(new Date().setHours(0, 0, 0, 0))) { // Check if departure date is in the past
+  } else if (false) { // Check if departure date is in the past
     errors.push('Departure date cannot be in the past.');
   }
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] EqualityOperator
server/index.js:87:14
   // Validate Departure Date format and presence
   if (!departureDate || !/^\d{4}-\d{2}-\d{2}$/.test(departureDate)) {
     errors.push('Invalid or missing departure date format. Expected YYYY-MM-DD.');
-  } else if (new Date(departureDate) < new Date(new Date().setHours(0, 0, 0, 0))) { // Check if departure date is in the past
+  } else if (new Date(departureDate) >= new Date(new Date().setHours(0, 0, 0, 0))) { // Check if departure date is in the past
     errors.push('Departure date cannot be in the past.');
   }
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] ConditionalExpression
server/index.js:92:7
   }
 
   // Validate Return Date if provided
-  if (returnDate) {
+  if (true) {
     if (!/^\d{4}-\d{2}-\d{2}$/.test(returnDate)) {
       errors.push('Invalid return date format. Expected YYYY-MM-DD.');
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] BlockStatement
server/index.js:92:19
   }
 
   // Validate Return Date if provided
-  if (returnDate) {
-    if (!/^\d{4}-\d{2}-\d{2}$/.test(returnDate)) {
-      errors.push('Invalid return date format. Expected YYYY-MM-DD.');
-    } else if (new Date(returnDate) < new Date(departureDate)) {
-      errors.push('Return date cannot be before departure date.');
-    }
-  }
+  if (returnDate) {}
 
   // Validate Number of Passengers
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] BooleanLiteral
server/index.js:93:9
 
   // Validate Return Date if provided
   if (returnDate) {
-    if (!/^\d{4}-\d{2}-\d{2}$/.test(returnDate)) {
+    if (/^\d{4}-\d{2}-\d{2}$/.test(returnDate)) {
       errors.push('Invalid return date format. Expected YYYY-MM-DD.');
     } else if (new Date(returnDate) < new Date(departureDate)) {
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] ConditionalExpression
server/index.js:93:9
 
   // Validate Return Date if provided
   if (returnDate) {
-    if (!/^\d{4}-\d{2}-\d{2}$/.test(returnDate)) {
+    if (true) {
       errors.push('Invalid return date format. Expected YYYY-MM-DD.');
     } else if (new Date(returnDate) < new Date(departureDate)) {
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] EqualityOperator
server/index.js:95:16
   if (returnDate) {
     if (!/^\d{4}-\d{2}-\d{2}$/.test(returnDate)) {
       errors.push('Invalid return date format. Expected YYYY-MM-DD.');
-    } else if (new Date(returnDate) < new Date(departureDate)) {
+    } else if (new Date(returnDate) <= new Date(departureDate)) {
       errors.push('Return date cannot be before departure date.');
     }
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] BlockStatement
server/index.js:95:64
   if (returnDate) {
     if (!/^\d{4}-\d{2}-\d{2}$/.test(returnDate)) {
       errors.push('Invalid return date format. Expected YYYY-MM-DD.');
-    } else if (new Date(returnDate) < new Date(departureDate)) {
-      errors.push('Return date cannot be before departure date.');
-    }
+    } else if (new Date(returnDate) < new Date(departureDate)) {}
   }
 
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] StringLiteral
server/index.js:96:19
     if (!/^\d{4}-\d{2}-\d{2}$/.test(returnDate)) {
       errors.push('Invalid return date format. Expected YYYY-MM-DD.');
     } else if (new Date(returnDate) < new Date(departureDate)) {
-      errors.push('Return date cannot be before departure date.');
+      errors.push("");
     }
   }
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] EqualityOperator
server/index.js:101:74
   }
 
   // Validate Number of Passengers
-  if (typeof passengers !== 'number' || !Number.isInteger(passengers) || passengers <= 0) {
+  if (typeof passengers !== 'number' || !Number.isInteger(passengers) || passengers > 0) {
     errors.push('Number of passengers must be a positive integer.');
   }
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] LogicalOperator
server/index.js:101:7
   }
 
   // Validate Number of Passengers
-  if (typeof passengers !== 'number' || !Number.isInteger(passengers) || passengers <= 0) {
+  if ((typeof passengers !== 'number' || !Number.isInteger(passengers)) && passengers <= 0) {
     errors.push('Number of passengers must be a positive integer.');
   }
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] ConditionalExpression
server/index.js:106:7
   }
 
   // Validate Selected Flight details
-  if (!selectedFlight || typeof selectedFlight !== 'object' || !selectedFlight.id) {
+  if (false) {
     errors.push('No flight selected for booking or selected flight details are incomplete.');
   } else {
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] ConditionalExpression
server/index.js:106:7
   }
 
   // Validate Selected Flight details
-  if (!selectedFlight || typeof selectedFlight !== 'object' || !selectedFlight.id) {
+  if (false || !selectedFlight.id) {
     errors.push('No flight selected for booking or selected flight details are incomplete.');
   } else {
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] BlockStatement
server/index.js:108:10
   // Validate Selected Flight details
   if (!selectedFlight || typeof selectedFlight !== 'object' || !selectedFlight.id) {
     errors.push('No flight selected for booking or selected flight details are incomplete.');
-  } else {
-    // Further validation for selected flight's critical properties
-    if (typeof selectedFlight.price !== 'number' || selectedFlight.price <= 0) {
-      errors.push('Selected flight has an invalid price. Price must be a positive number.');
-    }
-    if (typeof selectedFlight.type !== 'string' || !['Domestic', 'International'].includes(selectedFlight.type)) {
-      errors.push('Selected flight has an invalid type. Must be "Domestic" or "International".');
-    }
-  }
+  } else {}
 
   // Validate Extra Bags
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] BlockStatement
server/index.js:110:80
     errors.push('No flight selected for booking or selected flight details are incomplete.');
   } else {
     // Further validation for selected flight's critical properties
-    if (typeof selectedFlight.price !== 'number' || selectedFlight.price <= 0) {
-      errors.push('Selected flight has an invalid price. Price must be a positive number.');
-    }
+    if (typeof selectedFlight.price !== 'number' || selectedFlight.price <= 0) {}
     if (typeof selectedFlight.type !== 'string' || !['Domestic', 'International'].includes(selectedFlight.type)) {
       errors.push('Selected flight has an invalid type. Must be "Domestic" or "International".');
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] ConditionalExpression
server/index.js:110:53
     errors.push('No flight selected for booking or selected flight details are incomplete.');
   } else {
     // Further validation for selected flight's critical properties
-    if (typeof selectedFlight.price !== 'number' || selectedFlight.price <= 0) {
+    if (typeof selectedFlight.price !== 'number' || false) {
       errors.push('Selected flight has an invalid price. Price must be a positive number.');
     }
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] BooleanLiteral
server/index.js:113:52
     if (typeof selectedFlight.price !== 'number' || selectedFlight.price <= 0) {
       errors.push('Selected flight has an invalid price. Price must be a positive number.');
     }
-    if (typeof selectedFlight.type !== 'string' || !['Domestic', 'International'].includes(selectedFlight.type)) {
+    if (typeof selectedFlight.type !== 'string' || ['Domestic', 'International'].includes(selectedFlight.type)) {
       errors.push('Selected flight has an invalid type. Must be "Domestic" or "International".');
     }
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] ConditionalExpression
server/index.js:113:9
     if (typeof selectedFlight.price !== 'number' || selectedFlight.price <= 0) {
       errors.push('Selected flight has an invalid price. Price must be a positive number.');
     }
-    if (typeof selectedFlight.type !== 'string' || !['Domestic', 'International'].includes(selectedFlight.type)) {
+    if (true) {
       errors.push('Selected flight has an invalid type. Must be "Domestic" or "International".');
     }
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] EqualityOperator
server/index.js:119:7
   }
 
   // Validate Extra Bags
-  if (typeof extraBags !== 'number' || !Number.isInteger(extraBags) || extraBags < 0) {
+  if (typeof extraBags === 'number' || !Number.isInteger(extraBags) || extraBags < 0) {
     errors.push('Extra bags must be a non-negative integer.');
   }
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] LogicalOperator
server/index.js:119:7
   }
 
   // Validate Extra Bags
-  if (typeof extraBags !== 'number' || !Number.isInteger(extraBags) || extraBags < 0) {
+  if ((typeof extraBags !== 'number' || !Number.isInteger(extraBags)) && extraBags < 0) {
     errors.push('Extra bags must be a non-negative integer.');
   }
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] ArrayDeclaration
server/index.js:124:31
   }
 
   // Validate Meal Selection (assuming 'none', 'standard', 'premium' are valid)
-  const validMealSelections = ['none', 'standard', 'premium'];
+  const validMealSelections = [];
   if (mealSelection && !validMealSelections.includes(mealSelection)) {
       errors.push(`Invalid meal selection: "${mealSelection}". Valid options are ${validMealSelections.join(', ')}.`);
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] ConditionalExpression
server/index.js:125:7
 
   // Validate Meal Selection (assuming 'none', 'standard', 'premium' are valid)
   const validMealSelections = ['none', 'standard', 'premium'];
-  if (mealSelection && !validMealSelections.includes(mealSelection)) {
+  if (false) {
       errors.push(`Invalid meal selection: "${mealSelection}". Valid options are ${validMealSelections.join(', ')}.`);
   }
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] LogicalOperator
server/index.js:125:7
 
   // Validate Meal Selection (assuming 'none', 'standard', 'premium' are valid)
   const validMealSelections = ['none', 'standard', 'premium'];
-  if (mealSelection && !validMealSelections.includes(mealSelection)) {
+  if (mealSelection || !validMealSelections.includes(mealSelection)) {
       errors.push(`Invalid meal selection: "${mealSelection}". Valid options are ${validMealSelections.join(', ')}.`);
   }
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] StringLiteral
server/index.js:126:109
   // Validate Meal Selection (assuming 'none', 'standard', 'premium' are valid)
   const validMealSelections = ['none', 'standard', 'premium'];
   if (mealSelection && !validMealSelections.includes(mealSelection)) {
-      errors.push(`Invalid meal selection: "${mealSelection}". Valid options are ${validMealSelections.join(', ')}.`);
+      errors.push(`Invalid meal selection: "${mealSelection}". Valid options are ${validMealSelections.join("")}.`);
   }
 
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] BlockStatement
server/index.js:130:21
   }
 
   // Validate Discount Code (simple alphanumeric for now to prevent basic injection attempts)
-  if (discountCode) {
-    // Regex to allow alphanumeric characters, and specific safe symbols like hyphens.
-    // This will reject SQL injection attempts.
-    const discountCodePattern = /^[a-zA-Z0-9-]+$/;
-    if (typeof discountCode !== 'string' || !discountCodePattern.test(discountCode)) {
-      errors.push('Invalid discount code format. Only alphanumeric characters and hyphens are allowed.');
-    }
-  }
+  if (discountCode) {}
 
   // Validate Date of Birth if provided
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] ConditionalExpression
server/index.js:130:7
   }
 
   // Validate Discount Code (simple alphanumeric for now to prevent basic injection attempts)
-  if (discountCode) {
+  if (false) {
     // Regex to allow alphanumeric characters, and specific safe symbols like hyphens.
     // This will reject SQL injection attempts.
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] Regex
server/index.js:133:33
   if (discountCode) {
     // Regex to allow alphanumeric characters, and specific safe symbols like hyphens.
     // This will reject SQL injection attempts.
-    const discountCodePattern = /^[a-zA-Z0-9-]+$/;
+    const discountCodePattern = /[a-zA-Z0-9-]+$/;
     if (typeof discountCode !== 'string' || !discountCodePattern.test(discountCode)) {
       errors.push('Invalid discount code format. Only alphanumeric characters and hyphens are allowed.');
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] ConditionalExpression
server/index.js:134:9
     // Regex to allow alphanumeric characters, and specific safe symbols like hyphens.
     // This will reject SQL injection attempts.
     const discountCodePattern = /^[a-zA-Z0-9-]+$/;
-    if (typeof discountCode !== 'string' || !discountCodePattern.test(discountCode)) {
+    if (true) {
       errors.push('Invalid discount code format. Only alphanumeric characters and hyphens are allowed.');
     }
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] BlockStatement
server/index.js:134:86
     // Regex to allow alphanumeric characters, and specific safe symbols like hyphens.
     // This will reject SQL injection attempts.
     const discountCodePattern = /^[a-zA-Z0-9-]+$/;
-    if (typeof discountCode !== 'string' || !discountCodePattern.test(discountCode)) {
-      errors.push('Invalid discount code format. Only alphanumeric characters and hyphens are allowed.');
-    }
+    if (typeof discountCode !== 'string' || !discountCodePattern.test(discountCode)) {}
   }
 
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] ConditionalExpression
server/index.js:140:7
   }
 
   // Validate Date of Birth if provided
-  if (dateOfBirth) {
+  if (false) {
     if (!/^\d{4}-\d{2}-\d{2}$/.test(dateOfBirth)) {
       errors.push('Invalid date of birth format. Expected YYYY-MM-DD.');
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] ConditionalExpression
server/index.js:140:7
   }
 
   // Validate Date of Birth if provided
-  if (dateOfBirth) {
+  if (true) {
     if (!/^\d{4}-\d{2}-\d{2}$/.test(dateOfBirth)) {
       errors.push('Invalid date of birth format. Expected YYYY-MM-DD.');
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] ConditionalExpression
server/index.js:141:9
 
   // Validate Date of Birth if provided
   if (dateOfBirth) {
-    if (!/^\d{4}-\d{2}-\d{2}$/.test(dateOfBirth)) {
+    if (true) {
       errors.push('Invalid date of birth format. Expected YYYY-MM-DD.');
     } else if (new Date(dateOfBirth) > new Date()) {
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] BooleanLiteral
server/index.js:141:9
 
   // Validate Date of Birth if provided
   if (dateOfBirth) {
-    if (!/^\d{4}-\d{2}-\d{2}$/.test(dateOfBirth)) {
+    if (/^\d{4}-\d{2}-\d{2}$/.test(dateOfBirth)) {
       errors.push('Invalid date of birth format. Expected YYYY-MM-DD.');
     } else if (new Date(dateOfBirth) > new Date()) {
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[NoCoverage] StringLiteral
server/index.js:142:19
   // Validate Date of Birth if provided
   if (dateOfBirth) {
     if (!/^\d{4}-\d{2}-\d{2}$/.test(dateOfBirth)) {
-      errors.push('Invalid date of birth format. Expected YYYY-MM-DD.');
+      errors.push("");
     } else if (new Date(dateOfBirth) > new Date()) {
       errors.push('Date of Birth cannot be in the future.');

[Killed] ConditionalExpression
server/index.js:143:16
   if (dateOfBirth) {
     if (!/^\d{4}-\d{2}-\d{2}$/.test(dateOfBirth)) {
       errors.push('Invalid date of birth format. Expected YYYY-MM-DD.');
-    } else if (new Date(dateOfBirth) > new Date()) {
+    } else if (false) {
       errors.push('Date of Birth cannot be in the future.');
     }
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] EqualityOperator
server/index.js:143:16
   if (dateOfBirth) {
     if (!/^\d{4}-\d{2}-\d{2}$/.test(dateOfBirth)) {
       errors.push('Invalid date of birth format. Expected YYYY-MM-DD.');
-    } else if (new Date(dateOfBirth) > new Date()) {
+    } else if (new Date(dateOfBirth) <= new Date()) {
       errors.push('Date of Birth cannot be in the future.');
     }
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] ConditionalExpression
server/index.js:149:7
   }
 
   // If any validation errors are found, send a 400 Bad Request response.
-  if (errors.length > 0) {
+  if (false) {
     console.warn('Booking validation failed:', errors);
     return res.status(400).json({
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] BlockStatement
server/index.js:149:26
   }
 
   // If any validation errors are found, send a 400 Bad Request response.
-  if (errors.length > 0) {
-    console.warn('Booking validation failed:', errors);
-    return res.status(400).json({
-      success: false,
-      message: 'Booking request validation failed.',
-      errors: errors
-    });
-  }
+  if (errors.length > 0) {}
 
   // --- Price Calculation and Booking Simulation ---
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] StringLiteral
server/index.js:150:18
 
   // If any validation errors are found, send a 400 Bad Request response.
   if (errors.length > 0) {
-    console.warn('Booking validation failed:', errors);
+    console.warn("", errors);
     return res.status(400).json({
       success: false,
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] ConditionalExpression
server/index.js:161:29
   // --- Price Calculation and Booking Simulation ---
   try {
     // Extract necessary details for price calculation
-    const isInternational = selectedFlight.type === 'International';
+    const isInternational = true;
     const baseFare = selectedFlight.price;
 
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] ConditionalExpression
server/index.js:161:29
   // --- Price Calculation and Booking Simulation ---
   try {
     // Extract necessary details for price calculation
-    const isInternational = selectedFlight.type === 'International';
+    const isInternational = false;
     const baseFare = selectedFlight.price;
 
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002
