[Killed] ObjectLiteral
server/index.js:164:42
     const isInternational = selectedFlight.type === 'International';
     const baseFare = selectedFlight.price;
 
-    const bookingDetailsForCalculation = {
-      baseFare: baseFare,
-      numberOfPassengers: passengers,
-      isInternational: isInternational,
-      extraBags: extraBags,
-      mealSelection: mealSelection,
-      discountCode: discountCode,
-    };
+    const bookingDetailsForCalculation = {};
 
     // Calculate the final price using the imported utility function
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] ObjectLiteral
server/index.js:179:33
     // Simulate saving the booking to a database.
     // In a real application, this would involve database operations,
     // potentially user authentication, and transaction management.
-    const bookingConfirmation = {
-      bookingId: `BK-${Date.now()}-${Math.floor(Math.random() * 10000)}`, // Generate a unique booking ID
-      flightDetails: { // Store essential flight details
-        id: selectedFlight.id,
-        airline: selectedFlight.airline,
-        flightNumber: selectedFlight.flightNumber,
-        origin: selectedFlight.origin,
-        destination: selectedFlight.destination,
-        departureDate: selectedFlight.departureDate,
-        departureTime: selectedFlight.departureTime,
-      },
-      passengerCount: passengers,
-      bookedExtraBags: extraBags,
-      selectedMeal: mealSelection,
-      appliedDiscountCode: discountCode,
-      finalAmount: finalPrice,
-      status: 'Confirmed', // Simulate a confirmed status
-      bookingTimestamp: new Date().toISOString(),
-      customerDetails: { // Placeholder for customer info if provided
-        dateOfBirth: dateOfBirth,
-        // ... other customer details would go here
-      }
-    };
+    const bookingConfirmation = {};
 
     console.log('Flight booked successfully:', bookingConfirmation);
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] ArithmeticOperator
server/index.js:180:49
     // In a real application, this would involve database operations,
     // potentially user authentication, and transaction management.
     const bookingConfirmation = {
-      bookingId: `BK-${Date.now()}-${Math.floor(Math.random() * 10000)}`, // Generate a unique booking ID
+      bookingId: `BK-${Date.now()}-${Math.floor(Math.random() / 10000)}`, // Generate a unique booking ID
       flightDetails: { // Store essential flight details
         id: selectedFlight.id,
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] StringLiteral
server/index.js:180:18
     // In a real application, this would involve database operations,
     // potentially user authentication, and transaction management.
     const bookingConfirmation = {
-      bookingId: `BK-${Date.now()}-${Math.floor(Math.random() * 10000)}`, // Generate a unique booking ID
+      bookingId: ``, // Generate a unique booking ID
       flightDetails: { // Store essential flight details
         id: selectedFlight.id,
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] StringLiteral
server/index.js:207:16
     // Send a success response with the booking confirmation details.
     res.status(200).json({
       success: true,
-      message: 'Flight booked successfully!',
+      message: "",
       booking: bookingConfirmation,
     });
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[NoCoverage] BlockStatement
server/index.js:210:19
       message: 'Flight booked successfully!',
       booking: bookingConfirmation,
     });
-  } catch (error) {
-    // Catch any errors during price calculation or booking simulation
-    console.error('Error during booking process:', error.message, error.stack);
-    res.status(500).json({
-      success: false,
-      message: 'Internal server error during booking.',
-      error: error.message
-    });
-  }
+  } catch (error) {}
 });
 

[NoCoverage] StringLiteral
server/index.js:212:19
     });
   } catch (error) {
     // Catch any errors during price calculation or booking simulation
-    console.error('Error during booking process:', error.message, error.stack);
+    console.error("", error.message, error.stack);
     res.status(500).json({
       success: false,

[NoCoverage] StringLiteral
server/index.js:215:16
     console.error('Error during booking process:', error.message, error.stack);
     res.status(500).json({
       success: false,
-      message: 'Internal server error during booking.',
+      message: "",
       error: error.message
     });

[Killed] BlockStatement
server/index.js:224:39
 // --- Server Initialization ---
 
 // Start the Express server and listen for incoming requests on the specified PORT.
-const server = app.listen(PORT, () => {
-  console.log(`Server is running successfully on http://localhost:${PORT}`);
-  console.log('Press Ctrl+C to stop the server.');
-});
+const server = app.listen(PORT, () => {});
 
 module.exports = server;
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] StringLiteral
server/index.js:226:15
 // Start the Express server and listen for incoming requests on the specified PORT.
 const server = app.listen(PORT, () => {
   console.log(`Server is running successfully on http://localhost:${PORT}`);
-  console.log('Press Ctrl+C to stop the server.');
+  console.log("");
 });
 
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002
