[Killed] AssignmentOperator
server/utils/priceCalculator.js:177:3
   const actualMealSelection = (mealSelection && MEAL_FEES.hasOwnProperty(mealSelection))
     ? mealSelection
     : 'none';
-  totalPrice += MEAL_FEES[actualMealSelection] * numberOfPassengers; // Apply meal cost per passenger
+  totalPrice -= MEAL_FEES[actualMealSelection] * numberOfPassengers; // Apply meal cost per passenger
 
   // --- Discount Logic ---
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] ArithmeticOperator
server/utils/priceCalculator.js:177:17
   const actualMealSelection = (mealSelection && MEAL_FEES.hasOwnProperty(mealSelection))
     ? mealSelection
     : 'none';
-  totalPrice += MEAL_FEES[actualMealSelection] * numberOfPassengers; // Apply meal cost per passenger
+  totalPrice += MEAL_FEES[actualMealSelection] / numberOfPassengers; // Apply meal cost per passenger
 
   // --- Discount Logic ---
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] LogicalOperator
server/utils/priceCalculator.js:181:7
 
   // --- Discount Logic ---
   // Apply discounts only if a discount code is provided and is a string.
-  if (discountCode && typeof discountCode === 'string') {
+  if (discountCode || typeof discountCode === 'string') {
     const trimmedCode = discountCode.trim().toUpperCase(); // Trim whitespace and convert to uppercase for case-insensitivity
 
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] EqualityOperator
server/utils/priceCalculator.js:181:23
 
   // --- Discount Logic ---
   // Apply discounts only if a discount code is provided and is a string.
-  if (discountCode && typeof discountCode === 'string') {
+  if (discountCode && typeof discountCode !== 'string') {
     const trimmedCode = discountCode.trim().toUpperCase(); // Trim whitespace and convert to uppercase for case-insensitivity
 
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] MethodExpression
server/utils/priceCalculator.js:182:25
   // --- Discount Logic ---
   // Apply discounts only if a discount code is provided and is a string.
   if (discountCode && typeof discountCode === 'string') {
-    const trimmedCode = discountCode.trim().toUpperCase(); // Trim whitespace and convert to uppercase for case-insensitivity
+    const trimmedCode = discountCode.toUpperCase(); // Trim whitespace and convert to uppercase for case-insensitivity
 
     const FLY2025_DISCOUNT_PERCENTAGE = 0.10; // 10%
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] MethodExpression
server/utils/priceCalculator.js:182:25
   // --- Discount Logic ---
   // Apply discounts only if a discount code is provided and is a string.
   if (discountCode && typeof discountCode === 'string') {
-    const trimmedCode = discountCode.trim().toUpperCase(); // Trim whitespace and convert to uppercase for case-insensitivity
+    const trimmedCode = discountCode.trim().toLowerCase(); // Trim whitespace and convert to uppercase for case-insensitivity
 
     const FLY2025_DISCOUNT_PERCENTAGE = 0.10; // 10%
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] EqualityOperator
server/utils/priceCalculator.js:190:38
     const PROMO_DISCOUNT_AMOUNT = 10;        // Flat $10 for longer PROMO codes
 
     // Conditional discount application based on the trimmed code.
-    if (trimmedCode === 'FLY2025' && numberOfPassengers >= 1) { // Example of complex condition for mutation
+    if (trimmedCode === 'FLY2025' && numberOfPassengers > 1) { // Example of complex condition for mutation
       let discountAmount = totalPrice * FLY2025_DISCOUNT_PERCENTAGE; // Calculate 10% discount
       // Cap the discount at a maximum amount or if the total price is very low (another complex condition).
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] BlockStatement
server/utils/priceCalculator.js:190:63
     const PROMO_DISCOUNT_AMOUNT = 10;        // Flat $10 for longer PROMO codes
 
     // Conditional discount application based on the trimmed code.
-    if (trimmedCode === 'FLY2025' && numberOfPassengers >= 1) { // Example of complex condition for mutation
-      let discountAmount = totalPrice * FLY2025_DISCOUNT_PERCENTAGE; // Calculate 10% discount
-      // Cap the discount at a maximum amount or if the total price is very low (another complex condition).
-      if (discountAmount > FLY2025_MAX_DISCOUNT || totalPrice < 100) {
-        discountAmount = FLY2025_MAX_DISCOUNT;
-      }
-      totalPrice -= discountAmount;
-      console.log(`Discount 'FLY2025' applied: -$${discountAmount.toFixed(2)}`);
-    } else if (trimmedCode === 'SUMMER20' || trimmedCode === 'SAVE20') { // Multiple codes for same discount
+    if (trimmedCode === 'FLY2025' && numberOfPassengers >= 1) {} else if (trimmedCode === 'SUMMER20' || trimmedCode === 'SAVE20') { // Multiple codes for same discount
       totalPrice -= FLAT_DISCOUNT_AMOUNT;
       console.log(`Discount '${trimmedCode}' applied: -$${FLAT_DISCOUNT_AMOUNT.toFixed(2)}`);
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] ArithmeticOperator
server/utils/priceCalculator.js:191:28
 
     // Conditional discount application based on the trimmed code.
     if (trimmedCode === 'FLY2025' && numberOfPassengers >= 1) { // Example of complex condition for mutation
-      let discountAmount = totalPrice * FLY2025_DISCOUNT_PERCENTAGE; // Calculate 10% discount
+      let discountAmount = totalPrice / FLY2025_DISCOUNT_PERCENTAGE; // Calculate 10% discount
       // Cap the discount at a maximum amount or if the total price is very low (another complex condition).
       if (discountAmount > FLY2025_MAX_DISCOUNT || totalPrice < 100) {
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] LogicalOperator
server/utils/priceCalculator.js:193:11
     if (trimmedCode === 'FLY2025' && numberOfPassengers >= 1) { // Example of complex condition for mutation
       let discountAmount = totalPrice * FLY2025_DISCOUNT_PERCENTAGE; // Calculate 10% discount
       // Cap the discount at a maximum amount or if the total price is very low (another complex condition).
-      if (discountAmount > FLY2025_MAX_DISCOUNT || totalPrice < 100) {
+      if (discountAmount > FLY2025_MAX_DISCOUNT && totalPrice < 100) {
         discountAmount = FLY2025_MAX_DISCOUNT;
       }
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] EqualityOperator
server/utils/priceCalculator.js:193:11
     if (trimmedCode === 'FLY2025' && numberOfPassengers >= 1) { // Example of complex condition for mutation
       let discountAmount = totalPrice * FLY2025_DISCOUNT_PERCENTAGE; // Calculate 10% discount
       // Cap the discount at a maximum amount or if the total price is very low (another complex condition).
-      if (discountAmount > FLY2025_MAX_DISCOUNT || totalPrice < 100) {
+      if (discountAmount <= FLY2025_MAX_DISCOUNT || totalPrice < 100) {
         discountAmount = FLY2025_MAX_DISCOUNT;
       }
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] AssignmentOperator
server/utils/priceCalculator.js:196:7
       if (discountAmount > FLY2025_MAX_DISCOUNT || totalPrice < 100) {
         discountAmount = FLY2025_MAX_DISCOUNT;
       }
-      totalPrice -= discountAmount;
+      totalPrice += discountAmount;
       console.log(`Discount 'FLY2025' applied: -$${discountAmount.toFixed(2)}`);
     } else if (trimmedCode === 'SUMMER20' || trimmedCode === 'SAVE20') { // Multiple codes for same discount
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] LogicalOperator
server/utils/priceCalculator.js:198:16
       }
       totalPrice -= discountAmount;
       console.log(`Discount 'FLY2025' applied: -$${discountAmount.toFixed(2)}`);
-    } else if (trimmedCode === 'SUMMER20' || trimmedCode === 'SAVE20') { // Multiple codes for same discount
+    } else if (trimmedCode === 'SUMMER20' && trimmedCode === 'SAVE20') { // Multiple codes for same discount
       totalPrice -= FLAT_DISCOUNT_AMOUNT;
       console.log(`Discount '${trimmedCode}' applied: -$${FLAT_DISCOUNT_AMOUNT.toFixed(2)}`);
killedBy: Price Calculator Unit Tests Discount Code Application should apply flat $20 discount for "SUMMER20" discount code
statusReason: expected 112 to equal 92

[Killed] ConditionalExpression
server/utils/priceCalculator.js:198:16
       }
       totalPrice -= discountAmount;
       console.log(`Discount 'FLY2025' applied: -$${discountAmount.toFixed(2)}`);
-    } else if (trimmedCode === 'SUMMER20' || trimmedCode === 'SAVE20') { // Multiple codes for same discount
+    } else if (true) { // Multiple codes for same discount
       totalPrice -= FLAT_DISCOUNT_AMOUNT;
       console.log(`Discount '${trimmedCode}' applied: -$${FLAT_DISCOUNT_AMOUNT.toFixed(2)}`);
killedBy: Price Calculator Unit Tests Discount Code Application should apply flat $10 discount for PROMO codes longer than 10 characters
statusReason: expected 92 to equal 102

[Killed] AssignmentOperator
server/utils/priceCalculator.js:199:7
       totalPrice -= discountAmount;
       console.log(`Discount 'FLY2025' applied: -$${discountAmount.toFixed(2)}`);
     } else if (trimmedCode === 'SUMMER20' || trimmedCode === 'SAVE20') { // Multiple codes for same discount
-      totalPrice -= FLAT_DISCOUNT_AMOUNT;
+      totalPrice += FLAT_DISCOUNT_AMOUNT;
       console.log(`Discount '${trimmedCode}' applied: -$${FLAT_DISCOUNT_AMOUNT.toFixed(2)}`);
     } else if (trimmedCode.length > 10 && trimmedCode.includes('PROMO')) { // Length and keyword check
killedBy: Price Calculator Unit Tests Discount Code Application should apply flat $20 discount for "SUMMER20" discount code
statusReason: expected 132 to equal 92

[Killed] ConditionalExpression
server/utils/priceCalculator.js:201:16
     } else if (trimmedCode === 'SUMMER20' || trimmedCode === 'SAVE20') { // Multiple codes for same discount
       totalPrice -= FLAT_DISCOUNT_AMOUNT;
       console.log(`Discount '${trimmedCode}' applied: -$${FLAT_DISCOUNT_AMOUNT.toFixed(2)}`);
-    } else if (trimmedCode.length > 10 && trimmedCode.includes('PROMO')) { // Length and keyword check
+    } else if (false) { // Length and keyword check
       totalPrice -= PROMO_DISCOUNT_AMOUNT;
       console.log(`Discount 'PROMO' applied: -$${PROMO_DISCOUNT_AMOUNT.toFixed(2)}`);
killedBy: Price Calculator Unit Tests Discount Code Application should apply flat $10 discount for PROMO codes longer than 10 characters
statusReason: expected 112 to equal 102

[Killed] BlockStatement
server/utils/priceCalculator.js:201:74
     } else if (trimmedCode === 'SUMMER20' || trimmedCode === 'SAVE20') { // Multiple codes for same discount
       totalPrice -= FLAT_DISCOUNT_AMOUNT;
       console.log(`Discount '${trimmedCode}' applied: -$${FLAT_DISCOUNT_AMOUNT.toFixed(2)}`);
-    } else if (trimmedCode.length > 10 && trimmedCode.includes('PROMO')) { // Length and keyword check
-      totalPrice -= PROMO_DISCOUNT_AMOUNT;
-      console.log(`Discount 'PROMO' applied: -$${PROMO_DISCOUNT_AMOUNT.toFixed(2)}`);
-    } else {
+    } else if (trimmedCode.length > 10 && trimmedCode.includes('PROMO')) {} else {
       console.log(`Discount code '${discountCode}' is valid but no matching discount rules found.`);
     }
killedBy: Price Calculator Unit Tests Discount Code Application should apply flat $10 discount for PROMO codes longer than 10 characters
statusReason: expected 112 to equal 102

[Killed] AssignmentOperator
server/utils/priceCalculator.js:202:7
       totalPrice -= FLAT_DISCOUNT_AMOUNT;
       console.log(`Discount '${trimmedCode}' applied: -$${FLAT_DISCOUNT_AMOUNT.toFixed(2)}`);
     } else if (trimmedCode.length > 10 && trimmedCode.includes('PROMO')) { // Length and keyword check
-      totalPrice -= PROMO_DISCOUNT_AMOUNT;
+      totalPrice += PROMO_DISCOUNT_AMOUNT;
       console.log(`Discount 'PROMO' applied: -$${PROMO_DISCOUNT_AMOUNT.toFixed(2)}`);
     } else {
killedBy: Price Calculator Unit Tests Discount Code Application should apply flat $10 discount for PROMO codes longer than 10 characters
statusReason: expected 122 to equal 102

[Survived] BlockStatement
server/utils/priceCalculator.js:204:12
     } else if (trimmedCode.length > 10 && trimmedCode.includes('PROMO')) { // Length and keyword check
       totalPrice -= PROMO_DISCOUNT_AMOUNT;
       console.log(`Discount 'PROMO' applied: -$${PROMO_DISCOUNT_AMOUNT.toFixed(2)}`);
-    } else {
-      console.log(`Discount code '${discountCode}' is valid but no matching discount rules found.`);
-    }
+    } else {}
   }
 

[Killed] EqualityOperator
server/utils/priceCalculator.js:211:7
 
   // --- Final Adjustments ---
   // Ensure the total price never drops below zero, even after significant discounts.
-  if (totalPrice < 0) {
+  if (totalPrice <= 0) {
     console.warn(`Calculated price became negative (${totalPrice}). Capping at 0.`);
     totalPrice = 0;
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Killed] ConditionalExpression
server/utils/priceCalculator.js:211:7
 
   // --- Final Adjustments ---
   // Ensure the total price never drops below zero, even after significant discounts.
-  if (totalPrice < 0) {
+  if (true) {
     console.warn(`Calculated price became negative (${totalPrice}). Capping at 0.`);
     totalPrice = 0;
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002

[Survived] StringLiteral
server/utils/priceCalculator.js:212:18
   // --- Final Adjustments ---
   // Ensure the total price never drops below zero, even after significant discounts.
   if (totalPrice < 0) {
-    console.warn(`Calculated price became negative (${totalPrice}). Capping at 0.`);
+    console.warn(``);
     totalPrice = 0;
   }

[Killed] ObjectLiteral
server/utils/priceCalculator.js:221:18
 }
 
 // Export the function for use in other modules.
-module.exports = {
-  calculateFinalPrice,
-};
+module.exports = {};
killedBy: Client-Side Bypass Testing: /api/book Endpoint should reject booking with negative passenger count (-5)
statusReason: listen EADDRINUSE: address already in use :::3002
